Core/src/Documents/СчетФактураПолученныйГрузия/СчетФактураПолученныйГрузия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураПолученныйГрузия</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.АвансовыйОтчет</basedOn>
  <basedOn>Document.ДополнительныеРасходы</basedOn>
  <basedOn>Document.ОтчетПереработчика</basedOn>
  <basedOn>Document.ОтчетКомиссионера</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.РасходСоСчета</basedOn>
  <basedOn>Document.РасходИзКассы</basedOn>
  <registerRecords>AccumulationRegister.АвансыПолученныхФактур</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСФ</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКВозмещениюРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ДополнительныеРасходы</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыНаПортале</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПлатежа</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.РасходИзКассы</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/УчетнаяПолитикаРегл/УчетнаяПолитикаРегл.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаРегл</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>СчетНезавершенноеПроизводство</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаДеньги</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаДеньги</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаЗадолженность</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаЗадолженность</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>РозничныйКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорРозничногоКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДДСРозничныхПродаж</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрочихДоходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрочихРасходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрибыльУбытки</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетДеньгиВПути</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаКонвертация</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаКонвертация</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратБезвозмезднойПродажи</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДСБезвозмезднойПродажи</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаНалогаНаПрибыль</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаНалогаНаПрибыльПодлежащийОплате</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаИмпортРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаИмпортВозвратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетТранзитногоСклада</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ВидНадогаДляСчетовНДС</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратБезвозмезднойПродажиСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДСБезвозмезднойПродажиСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДФЛСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратПФСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратВозврат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаСвободнаяпродажа</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаСвободнаяпродажаСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ВидыОперацийРасходИзКассы/ВидыОперацийРасходИзКассы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходИзКассы</name>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>ЗарплатаСотруднику</name>
  </enumValues>
  <enumValues>
    <name>Налоги</name>
  </enumValues>
  <enumValues>
    <name>Подотчетнику</name>
  </enumValues>
  <enumValues>
    <name>Покупателю</name>
  </enumValues>
  <enumValues>
    <name>Поставщику</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеВКассуККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗаймаСотруднику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаКредитаКонтрагенту</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>НаРасходы</name>
  </enumValues>
  <enumValues>
    <name>ВзносНаличнымиВБанк</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыОперацийРасходСоСчета/ВидыОперацийРасходСоСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходСоСчета</name>
  <enumValues>
    <name>Поставщику</name>
  </enumValues>
  <enumValues>
    <name>Покупателю</name>
  </enumValues>
  <enumValues>
    <name>Подотчетнику</name>
  </enumValues>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>Налоги</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗаймаСотруднику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыНаПлатежныеКарты</name>
  </enumValues>
  <enumValues>
    <name>НаРасходы</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличных</name>
  </enumValues>
  <enumValues>
    <name>ПереводНаДругойСчет</name>
  </enumValues>
  <enumValues>
    <name>ЗарплатаВРазрезеСотрудников</name>
    <comment>// Kuzmich, 23.02.2019,Зарплата по ведомости в разрезе сотрудников</comment>
  </enumValues>
  <enumValues>
    <name>ПенсионномуФонду</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыРасчетов/ТипыРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасчетов</name>
  <enumValues>
    <name>Долг</name>
  </enumValues>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/СчетФактураПолученныйГрузия/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если Параметры.Свойство("СоздаемИзСчетФактурыНаПортале") Тогда
		ОбновитьТоварыИзДокументовОснованияСервер();
	//КонецЕсли;
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ДокументыПлатежа.Очистить();
		Объект.ТоварыНаПортале.Очистить();
		// Kuzmich, 18.09.2019, Добавление бух проводок в счет фактурах
		Объект.ВидНалога = НЕОПРЕДЕЛЕНО;
		Объект.СчетУчетаКВозмещениюРегл = НЕОПРЕДЕЛЕНО;
		// Kuzmich, 18.09.2019, Добавление бух проводок в счет фактурах
	КонецЕсли;
	
	УстановитьВидимость();
	ОбновитьПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДатаВходящегоДокументаПриИзменении(Неопределено);
	
	// Kuzmich, 18.09.2019, Добавление бух проводок в счет фактурах
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.Организация) Тогда
		УстановитьСчетНДСИзУчетнойПолитики();
	КонецЕсли;
	// Kuzmich, 18.09.2019, Добавление бух проводок в счет фактурах
	
КонецПроцедуры





////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	// Обработка события изменения организации.
	Объект.Номер = "";
	СтруктураДанные = ПолучитьДанныеОрганизацияПриИзменении(Объект.Организация);
	Компания = СтруктураДанные.Компания;
	// Kuzmich, 15.09.2019, Добавление бух проводок в счет фактурах
	УстановитьСчетНДСИзУчетнойПолитики();
	// Kuzmich, 15.09.2019, Добавление бух проводок в счет фактурах
КонецПроцедуры // ОрганизацияПриИзменении()

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Объект.ДокументыОснования.Очистить();
	
	ОбновитьТоварыИзДокументовОснованияСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТоварыИзДокументовОснования(Команда)
	
	ОбновитьТоварыИзДокументовОснованияСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьЦеныИВалюта()
	
	// Сформируем надпись цены и валюты.
	// Валюта.
	Если ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		ЦеныИВалюта = НСтр("ka='ვალუტა: %Валюта%, კურსი: %Курс%';ru='Валюта: %Валюта%, курс: %Курс%';en='Currency: Currency%% Rate:% Rate%'");
		ЦеныИВалюта = СтрЗаменить(ЦеныИВалюта, "%Валюта%", СокрЛП(Строка(Объект.ВалютаДокумента)));
		ЦеныИВалюта = СтрЗаменить(ЦеныИВалюта, "%Курс%", СокрЛП(Строка(Объект.Курс)));
	Иначе 	
		ЦеныИВалюта = НСтр("ka='ვალუტა: <არა>';ru='Валюта: <нет>';en='Currency: <none>'");	
	КонецЕсли;
		
КонецПроцедуры // УстановитьВидимостьИДоступность()	

&НаКлиенте
Процедура ДокументыОснованияПриИзменении(Элемент)
	
	ОбновитьТоварыИзДокументовОснованияСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументОснованиеПриИзменении(Элемент, ТекущиеДанные = Неопределено)
	
	Если ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = Элементы.ДокументыОснования.ТекущиеДанные;
	КонецЕсли;
	
	СтруктураСумм = РС_ОбщегоНазначения.ПолучитьСуммуИНДСДокументаВВалютеРасчета(ТекущиеДанные.ДокументОснование);
	
	ТекущиеДанные.СуммаДокумента = СтруктураСумм.Сумма;
	ТекущиеДанные.СуммаНДС = СтруктураСумм.СуммаНДС;
	ТекущиеДанные.Всего = СтруктураСумм.СуммаВсего;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВходящегоДокументаПриИзменении(Элемент)
	
	ПриИзмененииПериодаРегистрации(ЭтаФорма, "ДатаВходящегоДокумента", "ОтображениеПериода");
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВходящегоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(Объект.ДатаВходящегоДокумента = Дата('00010101'), ТекущаяДата(), Объект.ДатаВходящегоДокумента));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	Если ДатаКалендаряНачало = Неопределено Тогда
		Объект.ДатаВходящегоДокумента = КонецДня(Объект.ДатаВходящегоДокумента);
	Иначе
		Объект.ДатаВходящегоДокумента = КонецДня(ДатаКалендаряНачало);
	КонецЕсли;
	
	ДатаВходящегоДокументаПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ДатаВходящегоДокументаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ПриРегулированииПериодаРегистрации(ЭтаФорма, Направление, "ДатаВходящегоДокумента");
	ДатаВходящегоДокументаПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОснованияДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(0, НСтр("ka='გასავლის ზედდებული';ru='Расходная накладная';en='Sales Invoice'"));
	СЗ.Добавить(1, НСтр("ka='შემოსავლის ზედდებული';ru='Приходная накладная';en='Purchase Invoice'"));
	СЗ.Добавить(2, НСтр("ka='დამატებითი ხარჯები';ru='Дополнительные расходы';en='Additional expenses'"));
	СЗ.Добавить(3, НСтр("ka='ვალის კორექტირება';ru='Корректировка долга';en='adjustment of duty'"));
	
	
	ВыбранныйЭлемент = СЗ.ВыбратьЭлемент(НСтр("ka='Выберите тип документа';ru='Выберите тип документа';en='Select the type of document'"));
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = 0 Тогда
		ИмяДокумента = "РасходнаяНакладная";
	ИначеЕсли ВыбранныйЭлемент.Значение = 1 Тогда
		ИмяДокумента = "ПриходнаяНакладная";
	ИначеЕсли ВыбранныйЭлемент.Значение = 2 Тогда
		ИмяДокумента = "ДополнительныеРасходы";
	ИначеЕсли ВыбранныйЭлемент.Значение = 3 Тогда
		ИмяДокумента = "Взаимозачет";	
	КонецЕсли;
	
	ФормаВыбора = ПолучитьФорму("Документ." + ИмяДокумента + ".ФормаВыбора", , ЭтаФорма);
	ФормаВыбора.Элементы.Список.МножественныйВыбор = Истина;	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(ФормаВыбора.Список, "Контрагент", Объект.Контрагент, ЗначениеЗаполнено(Объект.Контрагент),ВидСравненияКомпоновкиДанных.Равно);
	
	СписокДокументов = ПолучитьСписокДокументов();
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьЭлементОтбораСписка(ФормаВыбора.Список,"Ссылка",СписокДокументов,,ВидСравненияКомпоновкиДанных.НеВСписке);
	
	ВыбранныеДокументы = ФормаВыбора.ОткрытьМодально();
	
	Если ВыбранныеДокументы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПервыйВыбранныйДокумент = Истина;
	Для Каждого ВыбранныйДокумент Из ВыбранныеДокументы Цикл
		Если Не ПервыйВыбранныйДокумент Тогда
			НоваяСтрокаТЧ = Объект.ДокументыОснования.Добавить();
		Иначе
			НоваяСтрокаТЧ = Элементы.ДокументыОснования.ТекущиеДанные;
		КонецЕсли;
		НоваяСтрокаТЧ.ДокументОснование = ВыбранныйДокумент;
		
		ДокументыОснованияДокументОснованиеПриИзменении(Неопределено, НоваяСтрокаТЧ);
		ПервыйВыбранныйДокумент = Ложь;
	КонецЦикла;
			
	ОбновитьТоварыИзДокументовОснованияСервер();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДокументов()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетФактураПолученныйГрузияДокументыОснования.ДокументОснование
	               |ИЗ
	               |	Документ.СчетФактураПолученныйГрузия.ДокументыОснования КАК СчетФактураПолученныйГрузияДокументыОснования
	               |ГДЕ
	               |	СчетФактураПолученныйГрузияДокументыОснования.Ссылка.Проведен = ИСТИНА";
	
	
	МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументОснование");
	
	
	Для Каждого Стр Из Объект.ДокументыОснования Цикл
		Если МассивДокументов.Найти(Стр.ДокументОснование) = Неопределено Тогда
			МассивДокументов.Добавить(Стр.ДокументОснование);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции	




////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ОбновитьПодвал(ТолькоТоварыДокументовОснования = Ложь)
	
	Если Не ТолькоТоварыДокументовОснования Тогда
		ПодвалНоменклатураТоварыНаПортале = Объект.ТоварыНаПортале.Количество();
		ПодвалКоличествоТоварыНаПортале = Объект.ТоварыНаПортале.Итог("Количество");
		ПодвалСуммаТоварыНаПортале = Объект.ТоварыНаПортале.Итог("Сумма");
		ПодвалСуммаНДСТоварыНаПортале = Объект.ТоварыНаПортале.Итог("СуммаНДС");
		ПодвалСуммаАкцизаТоварыНаПортале = Объект.ТоварыНаПортале.Итог("СуммаАкциза");
	КонецЕсли;
	
	ПодвалНоменклатураТоварыДокументовОснования = ТоварыДокументовОснования.Количество();
	ПодвалКоличествоТоварыДокументовОснования = ТоварыДокументовОснования.Итог("Количество");
	ПодвалСуммаТоварыДокументовОснования = ТоварыДокументовОснования.Итог("Всего");
	ПодвалСуммаНДСТоварыДокументовОснования = ТоварыДокументовОснования.Итог("СуммаНДС");
	ПодвалСуммаАкцизаТоварыДокументовОснования = ТоварыДокументовОснования.Итог("СуммаАкциза");
	
	СуммыРавны = (ПодвалСуммаТоварыНаПортале = ПодвалСуммаТоварыДокументовОснования);
	СуммыНДСРавны = (ПодвалСуммаНДСТоварыНаПортале = ПодвалСуммаНДСТоварыДокументовОснования);
	СуммыАкцизаРавны = (ПодвалСуммаАкцизаТоварыНаПортале = ПодвалСуммаАкцизаТоварыДокументовОснования);
	
	Объект.СуммаДокумента = ПодвалСуммаТоварыДокументовОснования;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТоварыИзДокументовОснованияСервер()
	
	ТоварыДокументовОснования.Очистить();
	
	Для Каждого СтрокаДокументыОснования Из Объект.ДокументыОснования Цикл
		Если ЗначениеЗаполнено(СтрокаДокументыОснования.ДокументОснование) Тогда
			Если Не ТипЗнч(СтрокаДокументыОснования.ДокументОснование) = Тип("ДокументСсылка.ДополнительныеРасходы") И
				 Не ТипЗнч(СтрокаДокументыОснования.ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная")Тогда
				Для Каждого СтрокаТЧ Из СтрокаДокументыОснования.ДокументОснование.Запасы Цикл
					СтрокаТЗ = ТоварыДокументовОснования.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаТЧ);
					СтрокаТЗ.НоменклатураКод = СтрокаТЧ.Номенклатура.Код;
					
					СтруктураСумм = РС_ОбщегоНазначения.ПолучитьСуммуИНДСДокументаВВалютеРасчета(СтрокаДокументыОснования.ДокументОснование);
					
					КоефДокумента = СтрокаТЧ.Всего/СтрокаДокументыОснования.ДокументОснование.СуммаДокумента;
					
					СтрокаТЗ.Сумма    = СтруктураСумм.Сумма * КоефДокумента;
					СтрокаТЗ.Всего    = СтруктураСумм.СуммаВсего * КоефДокумента;
					СтрокаТЗ.СуммаНДС = СтруктураСумм.СуммаНДС * КоефДокумента;
				КонецЦикла;
			КонецЕсли;
			
			Если Не ТипЗнч(СтрокаДокументыОснования.ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") И Не ТипЗнч(СтрокаДокументыОснования.ДокументОснование) = Тип("ДокументСсылка.ОтчетПереработчика") Тогда
				Для Каждого СтрокаТЧ Из СтрокаДокументыОснования.ДокументОснование.Расходы Цикл
					СтрокаТЗ = ТоварыДокументовОснования.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаТЧ);
					СтрокаТЗ.НоменклатураКод = СтрокаТЧ.Номенклатура.Код;
					
					СтруктураСумм = РС_ОбщегоНазначения.ПолучитьСуммуИНДСДокументаВВалютеРасчета(СтрокаДокументыОснования.ДокументОснование);
					
					КоефДокумента = СтрокаТЧ.Всего/СтрокаДокументыОснования.ДокументОснование.СуммаДокумента;
					
					СтрокаТЗ.Сумма    = СтруктураСумм.Сумма * КоефДокумента;
					СтрокаТЗ.Всего    = СтруктураСумм.СуммаВсего * КоефДокумента;
					СтрокаТЗ.СуммаНДС = СтруктураСумм.СуммаНДС * КоефДокумента;					
				КонецЦикла;
			КонецЕсли;
			
			    //++LAZARE
			Если ТипЗнч(СтрокаДокументыОснования.ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
				Для Каждого СтрокаТЧ Из СтрокаДокументыОснования.ДокументОснование.Запасы Цикл
					СтрокаТЗ = ТоварыДокументовОснования.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаТЧ);
					СтрокаТЗ.НоменклатураКод = СтрокаТЧ.Номенклатура.Код;
					СтруктураСумм = РС_ОбщегоНазначения.ПолучитьСуммуИНДСДокументаВВалютеРасчета(СтрокаДокументыОснования.ДокументОснование);
					КоефДокумента = СтрокаТЧ.Всего/СтрокаДокументыОснования.ДокументОснование.СуммаДокумента;
					СтрокаТЗ.Сумма    = СтруктураСумм.Сумма * КоефДокумента;
					СтрокаТЗ.Всего    = СтруктураСумм.СуммаВсего * КоефДокумента;
					СтрокаТЗ.СуммаНДС = СтруктураСумм.СуммаНДС * КоефДокумента;
				КонецЦикла;
			КонецЕсли;
			//--LAZARE			
			
			Если ТипЗнч(СтрокаДокументыОснования.ДокументОснование) = Тип("ДокументСсылка.ОтчетПереработчика") Тогда
				Для Каждого СтрокаТЧ Из СтрокаДокументыОснования.ДокументОснование.Продукция Цикл
					СтрокаТЗ = ТоварыДокументовОснования.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТЗ, СтрокаТЧ);
					СтрокаТЗ.НоменклатураКод = СтрокаТЧ.Номенклатура.Код;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДокументыОснования.ДокументОснование) Тогда
			СтруктураСумм = РС_ОбщегоНазначения.ПолучитьСуммуИНДСДокументаВВалютеРасчета(СтрокаДокументыОснования.ДокументОснование);
			
			СтрокаДокументыОснования.СуммаДокумента = СтруктураСумм.Сумма;
			СтрокаДокументыОснования.СуммаНДС = СтруктураСумм.СуммаНДС;
			СтрокаДокументыОснования.Всего = СтруктураСумм.СуммаВсего;
			
		КонецЕсли;
	КонецЦикла;
	
	//Для Каждого СтрокаДокументыОснования Из Объект.ДокументыОснования Цикл
	//	Если ЗначениеЗаполнено(СтрокаДокументыОснования.ДокументОснование) И
	//		 ТипЗнч(СтрокаДокументыОснования.ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная")Тогда
	//		Для Каждого СтрокаТЧ Из СтрокаДокументыОснования.ДокументОснование.Запасы Цикл
	//			СтрокиТЗ = ТоварыДокументовОснования.НайтиСтроки(Новый Структура("НоменклатураКод", СтрокаТЧ.Номенклатура.Код));
	//			Если Не СтрокиТЗ.Количество() = 0 Тогда
	//				НужноРаспределить = СтрокаТЧ.Количество;
	//				МассивДляУдаления = Новый Массив;
	//				Для Каждого СтрокаТЗ Из СтрокиТЗ Цикл
	//					КоличествоРаспределения = Мин(НужноРаспределить, СтрокаТЗ.Количество);
	//					ПредКоличество = СтрокаТЗ.Количество;
	//					СтрокаТЗ.Количество = СтрокаТЗ.Количество - КоличествоРаспределения;
	//					СтрокаТЗ.Сумма = СтрокаТЗ.Сумма * СтрокаТЗ.Количество / ПредКоличество;
	//					СтрокаТЗ.СуммаНДС = СтрокаТЗ.СуммаНДС * СтрокаТЗ.Количество / ПредКоличество;
	//					СтрокаТЗ.СуммаАкциза = СтрокаТЗ.СуммаАкциза * СтрокаТЗ.Количество / ПредКоличество;
	//					СтрокаТЗ.Всего = СтрокаТЗ.Всего * СтрокаТЗ.Количество / ПредКоличество;
	//					
	//					Если СтрокаТЗ.Количество = 0 Тогда
	//						МассивДляУдаления.Добавить(СтрокаТЗ);
	//					КонецЕсли;
	//					
	//					НужноРаспределить = НужноРаспределить - КоличествоРаспределения;
	//					Если НужноРаспределить = 0 Тогда
	//						Прервать;
	//					КонецЕсли;
	//				КонецЦикла;
	//				
	//				Для Каждого ЭлементМассива Из МассивДляУдаления Цикл
	//					ТоварыДокументовОснования.Удалить(ТоварыДокументовОснования.Индекс(ЭлементМассива));
	//				КонецЦикла;
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЦикла;
	
	ОбновитьПодвал(Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОрганизацияПриИзменении(Организация)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Компания", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСуммуИНДСУДокумента(ДокументСсылка)
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ОтчетПереработчика") Тогда
		СуммаДокумент    = ДокументСсылка.Сумма * ДокументСсылка.Курс * ДокументСсылка.Кратность;
		СуммаНДСДокумент = ДокументСсылка.СуммаНДС * ДокументСсылка.Курс * ДокументСсылка.Кратность;
		СуммаВсего       = ДокументСсылка.Всего * ДокументСсылка.Курс * ДокументСсылка.Кратность;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Взаимозачет") Тогда 
		СуммаДокумент	 = ДокументСсылка.СуммаРасчетов * ДокументСсылка.Курс * ДокументСсылка.Кратность;
		СуммаНДСДокумент = 0;
		СуммаВсего       = ДокументСсылка.СуммаРасчетов * ДокументСсылка.Курс * ДокументСсылка.Кратность;
	Иначе	 
		
		СуммаДокумент = ДокументСсылка.СуммаДокумента * ДокументСсылка.Курс * ДокументСсылка.Кратность;
		//Паганини_
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ДополнительныеРасходы") Тогда
			СуммаНДСДокумент = ДокументСсылка.Расходы.Итог("СуммаНДС") * ДокументСсылка.Курс * ДокументСсылка.Кратность;
		Иначе//_Паганини
			СуммаНДСДокумент = (ДокументСсылка.Запасы.Итог("СуммаНДС") * ДокументСсылка.Курс * ДокументСсылка.Кратность) + ?(ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная"), ДокументСсылка.Расходы.Итог("СуммаНДС") * ДокументСсылка.Курс * ДокументСсылка.Кратность, 0);
		КонецЕсли;//Паганини
		СуммаВсего = ?(ДокументСсылка.НДСВключатьВСтоимость, СуммаДокумент, СуммаДокумент + СуммаНДСДокумент * ДокументСсылка.Курс * ДокументСсылка.Кратность);
	КонецЕсли;
	
	Возврат Новый Структура("Сумма, СуммаНДС, СуммаВсего", СуммаДокумент, СуммаНДСДокумент, СуммаВсего);
	
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтаФорма.Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериодаРегистрации(ПереданнаяФорма, ИмяРеквизита, ИмяОтображения)
    	
	ПереданнаяФорма.Объект[ИмяРеквизита] 	= НачалоМесяца(ПереданнаяФорма.Объект[ИмяРеквизита]);
	ПереданнаяФорма[ИмяОтображения] 		= Формат(ПереданнаяФорма.Объект[ИмяРеквизита], НСТР("ka=""Л=ka; ДФ='MMMM yyyy'"";ru=""ДФ='MMMM yyyy'"";en=""ДФ='MMMM yyyy'"""));
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриРегулированииПериодаРегистрации(ПереданнаяФорма, Направление, ИмяРеквизита) Экспорт
	
	ПереданнаяФорма.Объект[ИмяРеквизита] = ?(ЗначениеЗаполнено(ПереданнаяФорма.Объект[ИмяРеквизита]), 
						ДобавитьМесяц(ПереданнаяФорма.Объект[ИмяРеквизита], Направление),
						ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), Направление));
		
КонецПроцедуры



&НаКлиенте
Процедура ДокументыПлатежаДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = Новый СписокЗначений; 
	СписокВыбора.Добавить(Тип("ДокументСсылка.РасходИзКассы")); 
	СписокВыбора.Добавить(Тип("ДокументСсылка.РасходСоСчета")); 
	СписокВыбора.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));  
	
	ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора);
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗначениеОтбора  = Новый Структура;
	Если ВыбранноеЗначение.Значение = Тип("ДокументСсылка.РасходИзКассы") Тогда 
		
		ИмяДокумента = "РасходИзКассы";
		ЗначениеОтбора.Вставить("ВидОперации",	ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Поставщику"));
		ЗначениеОтбора.Вставить("Контрагент",	Объект.Контрагент);
		
	ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.РасходСоСчета") Тогда 
		
		ИмяДокумента = "РасходСоСчета";
		ЗначениеОтбора.Вставить("ВидОперации",	ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Поставщику"));
		ЗначениеОтбора.Вставить("Контрагент",	Объект.Контрагент);
		
	ИначеЕсли ВыбранноеЗначение.Значение = Тип("ДокументСсылка.АвансовыйОтчет") Тогда 
		 
		ИмяДокумента = "АвансовыйОтчет";
		ЗначениеОтбора.Вставить("Ссылка",		СписокДокументаВыданногоАванса());
		
	КонецЕсли;

	ЗначениеОтбора.Вставить("Проведен", Истина);
	пПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);   
	Форма = ОткрытьФорму("Документ." +ИмяДокумента+".ФормаВыбора",пПараметрыВыбора,Элемент);
	
КонецПроцедуры

Функция СписокДокументаВыданногоАванса();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвансовыйОтчетОплаты.Ссылка
		|ИЗ
		|	Документ.АвансовыйОтчет.Оплаты КАК АвансовыйОтчетОплаты
		|ГДЕ
		|	АвансовыйОтчетОплаты.Ссылка.Проведен
		|	И АвансовыйОтчетОплаты.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	СписокКонтрагентов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат Новый ФиксированныйМассив(СписокКонтрагентов);
	
КонецФункции

&НаКлиенте
Процедура АвансПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Если Объект.Аванс Тогда
		Элементы.Контроль.Видимость 				= Ложь;
		Элементы.ГруппаАвансы.Видимость 			= Истина;
		Элементы.ИтогиАванс.Видимость 				= Истина;
		// Kuzmich, 18.09.2019, Добавление бух проводок в счет фактурах
		Объект.ВидНалога = НЕОПРЕДЕЛЕНО;
		Объект.СчетУчетаКВозмещениюРегл = НЕОПРЕДЕЛЕНО;
		// Kuzmich, 18.09.2019, Добавление бух проводок в счет фактурах
	Иначе
		Элементы.Контроль.Видимость 				= Истина;
		Элементы.ГруппаАвансы.Видимость 			= Ложь;
		Элементы.ИтогиАванс.Видимость 				= Ложь;
	КонецЕсли;
	
	Элементы.СчетНДС.Видимость = НЕ (Объект.Аванс); // Kuzmich, 18.09.2019, Добавление бух проводок в счет фактурах
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансы(Команда)
	ЗаполнитьАвансыНаСервере();
	Модифицированность = Истина;
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьАвансыНаСервере()
	
	ТаблицаАвансов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьТаблицуАвансов(Объект.Ссылка, "СчетФактураПолученныйГрузия", Объект.ДатаВходящегоДокумента, Объект.Организация, Объект.Контрагент);
	Объект.ДокументыПлатежа.Загрузить(ТаблицаАвансов);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьАвансы(Команда)
	СтруктураАдреса = ПолучитьАдресТаблицыОстатков();
	Результат = ОткрытьФормуМодально("Документ.СчетФактураПолученныйГрузия.Форма.ФормаОстаткиАвансов", СтруктураАдреса);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьВыделенныеСтроки(Результат.АдресТаблицы);
	Модифицированность = Истина;
КонецПроцедуры

Процедура ЗаполнитьВыделенныеСтроки(АдресТаблицы)
	ВыделенныеСтроки = ПолучитьИзВременногоХранилища(АдресТаблицы);
	Для Каждого СтрокаТЧ ИЗ ВыделенныеСтроки Цикл
		НовСтрока = Объект.ДокументыПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЧ);
	КонецЦикла;
КонецПроцедуры
&НаСервере
Функция ПолучитьАдресТаблицыОстатков()
	ТаблицаАвансов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьТаблицуАвансов(Объект.Ссылка, "СчетФактураПолученныйГрузия", Объект.ДатаВходящегоДокумента, Объект.Организация, Объект.Контрагент, Объект.ДокументыПлатежа);
	Возврат Новый Структура("АдресТаблицы", ПоместитьВоВременноеХранилище(ТаблицаАвансов));
КонецФункции

&НаКлиенте
Процедура ДокументыПлатежаСуммаПриИзменении(Элемент)
	ТекДанные = Элементы.ДокументыПлатежа.ТекущиеДанные;
	ТекДанные.СуммаНДС = Окр(ТекДанные.Сумма * 18/118, 2);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПлатежаДокументОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЗаполнитьДанныеДокументаАванса(ВыбранноеЗначение, Элементы.ДокументыПлатежа.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДокументаАванса(Документ, ИД)
	
	РасчетыСПоставщиками = Документ.Получитьобъект().Движения.РасчетыСПоставщиками;
	РасчетыСПоставщиками.Прочитать();
	ЕстьСтрокиАвансов	= Ложь;
	ПерваяСтрока		= Истина;
	Для Каждого СтрокаДвижения Из РасчетыСПоставщиками Цикл
		Если СтрокаДвижения.ТипРасчетов = Перечисления.ТипыРасчетов.Аванс Тогда
			Если ПерваяСтрока Тогда
				НовСтрока = Объект.ДокументыПлатежа.НайтиПоИдентификатору(ИД);
				ПерваяСтрока = Ложь;
			Иначе
				НовСтрока = Объект.ДокументыПлатежа.Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаДвижения);
			НовСтрока.СуммаНДС = Окр(СтрокаДвижения.Сумма * 18/118, 2);
			ЕстьСтрокиАвансов	= Истина;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ЕстьСтрокиАвансов Тогда
		ТекСтрока = Объект.ДокументыПлатежа.НайтиПоИдентификатору(ИД);
		ТекСтрока.Сумма		= 0;
		ТекСтрока.СуммаНДС	= 0;
		ТекСтрока.Договор	= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПлатежаДокументПриИзменении(Элемент)
	ТекСтрока = Элементы.ДокументыПлатежа.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекСтрока.Документ) Тогда
		ТекСтрока.Сумма		= 0;
		ТекСтрока.СуммаНДС	= 0;
		ТекСтрока.Договор	= Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПерепрочитатьФорму" Тогда
		Прочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

// Kuzmich, 15.09.2019, Добавление бух проводок в счет фактурах
&НаСервере
Процедура УстановитьСчетНДСИзУчетнойПолитики()

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
	
		ТекДата = ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата());
		ТекУчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаРегл.ПолучитьПоследнее(ТекДата, Новый Структура("Организация", Объект.Организация));
		
		Если НЕ ЗначениеЗаполнено(Объект.ВидНалога) Тогда
		
			Объект.ВидНалога = ТекУчетнаяПолитика.ВидНадогаДляСчетовНДС;
		
		КонецЕсли;
		
		УстановитьСчетУчетаКВозмещениюРеглИзВидаНалога();
			
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьСчетУчетаКВозмещениюРеглИзВидаНалога()

	Если ЗначениеЗаполнено(Объект.ВидНалога) Тогда
	
		//Если  НЕ ЗначениеЗаполнено(Объект.СчетУчетаКВозмещениюРегл)  Тогда
		
			Объект.СчетУчетаКВозмещениюРегл = Объект.ВидНалога.СчетУчетаКВозмещениюРегл;
		
		//КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидНалогаПриИзменении(Элемент)
	
	УстановитьСчетУчетаКВозмещениюРеглИзВидаНалога();
	
КонецПроцедуры
// Kuzmich, 15.09.2019, Добавление бух проводок в счет фактурах
